In [1]:
import os

import numpy as np
import pandas as pd

In [2]:
data = np.array([1, 2, 3, 4, 5])
data

array([1, 2, 3, 4, 5])

In [3]:
pd.Series(data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
data.ndim

1

In [5]:
emp = {"id": [], "name": [], "age": [], "salary": []}

pf = pd.DataFrame(emp)

pf

Empty DataFrame
Columns: [id, name, age, salary]
Index: []

In [6]:
emp_data = [
    (101, "Deepak", 25, 250000),
    (102, "Shyam", 22, 300000),
    (103, "Arun", 23, 150000),
    (104, "Manu", 20, 100000),
    (105, "Jeena", 27, 300000),
]

pf = pd.DataFrame(emp_data, columns=["id", "Name", "Age", "Salary"])
pf

    id    Name  Age  Salary
0  101  Deepak   25  250000
1  102   Shyam   22  300000
2  103    Arun   23  150000
3  104    Manu   20  100000
4  105   Jeena   27  300000

In [7]:
emp_data_list = [
    {"id": 101, "name": "Deepak", "age": 25, "salary": 250000},
    {"id": 102, "name": "Shyam", "age": 22, "salary": 300000},
    {"id": 103, "name": "Arun", "age": 23, "salary": 150000},
    {"id": 104, "name": "Manu", "age": 20, "salary": 100000},
    {"id": 105, "name": "Jeena", "age": 27, "salary": 300000},
]

df = pd.DataFrame(emp_data_list)
df

    id    name  age  salary
0  101  Deepak   25  250000
1  102   Shyam   22  300000
2  103    Arun   23  150000
3  104    Manu   20  100000
4  105   Jeena   27  300000

In [8]:
data = pd.read_csv(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/homeprices.csv"
)  # can also be used to open and read txt files
data

   area   price
0  2600  550000
1  3000  565000
2  3200  610000
3  3600  680000
4  4000  725000

In [9]:
print(os.getcwd())

/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env

In [10]:
data1 = pd.read_excel(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/Tableau_Joins_File.xlsx",
    "JobTitle",
)
data1

   EmployeeID     EmployeeName                           JobTitle
0      1001.0      Jim Halpert                           Salesman
1      1002.0      Pam Beasley                       Receptionist
2      1003.0   Dwight Schrute  Assistant to the Regional Manager
3      1004.0  Toby Flenderson                                 HR
4      1005.0    Angela Martin                         Accountant
5      1006.0    Michael Scott                   Regional Manager
6      1007.0  Meredith Palmer                 Supplier Relations
7      1008.0   Stanley Hudson                           Salesman
8      1009.0     Kevin Malone                         Accountant
9         NaN      Ryan Howard                               Temp

In [11]:
data3 = pd.read_csv(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv"
)
data3

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [12]:
data3 = pd.read_csv(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv",
    skiprows=2,
)
data3

   01-04-2017  newyork  36   7   Sunny
0  01-05-2017  newyork  28  12    Snow
1  01-06-2017  newyork  33   7   Sunny
2  01-07-2017   mumbai  90   5   Sunny
3  01-08-2017   mumbai  85  12     Fog
4  01-09-2017   mumbai  87  15     Fog
5  01-10-2017   mumbai  92   5    Rain
6  01-11-2017    paris  45  20   Sunny
7  01-12-2017    paris  50  13  Cloudy
8  01-13-2017    paris  54   8  Cloudy
9  01-14-2017    paris  42  10  Cloudy

In [13]:
data3 = pd.read_csv(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv",
    header=2,
)
data3

   01-04-2017  newyork  36   7   Sunny
0  01-05-2017  newyork  28  12    Snow
1  01-06-2017  newyork  33   7   Sunny
2  01-07-2017   mumbai  90   5   Sunny
3  01-08-2017   mumbai  85  12     Fog
4  01-09-2017   mumbai  87  15     Fog
5  01-10-2017   mumbai  92   5    Rain
6  01-11-2017    paris  45  20   Sunny
7  01-12-2017    paris  50  13  Cloudy
8  01-13-2017    paris  54   8  Cloudy
9  01-14-2017    paris  42  10  Cloudy

In [14]:
data3 = pd.read_csv(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv",
    nrows=5,
)
data3

          day     city  temperature  windspeed  event
0  01-01-2017  newyork           32          6   Rain
1  01-04-2017  newyork           36          7  Sunny
2  01-05-2017  newyork           28         12   Snow
3  01-06-2017  newyork           33          7  Sunny
4  01-07-2017   mumbai           90          5  Sunny

In [15]:
data3 = pd.read_csv(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv",
    nrows=10,
)
data3

          day     city  temperature  windspeed   event
0  01-01-2017  newyork           32          6    Rain
1  01-04-2017  newyork           36          7   Sunny
2  01-05-2017  newyork           28         12    Snow
3  01-06-2017  newyork           33          7   Sunny
4  01-07-2017   mumbai           90          5   Sunny
5  01-08-2017   mumbai           85         12     Fog
6  01-09-2017   mumbai           87         15     Fog
7  01-10-2017   mumbai           92          5    Rain
8  01-11-2017    paris           45         20   Sunny
9  01-12-2017    paris           50         13  Cloudy

In [16]:
data3 = pd.read_csv(
    r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv",
    names= ["ticker","eps","revenue","price","people"],
)
data3

        ticker      eps      revenue      price  people
0          day     city  temperature  windspeed   event
1   01-01-2017  newyork           32          6    Rain
2   01-04-2017  newyork           36          7   Sunny
3   01-05-2017  newyork           28         12    Snow
4   01-06-2017  newyork           33          7   Sunny
5   01-07-2017   mumbai           90          5   Sunny
6   01-08-2017   mumbai           85         12     Fog
7   01-09-2017   mumbai           87         15     Fog
8   01-10-2017   mumbai           92          5    Rain
9   01-11-2017    paris           45         20   Sunny
10  01-12-2017    paris           50         13  Cloudy
11  01-13-2017    paris           54          8  Cloudy
12  01-14-2017    paris           42         10  Cloudy

In [17]:
emp_data = [
    (101, "Deepak", 25, 250000),
    (102, "Shyam", 22, 300000),
    (103, "Arun", 23, 150000),
    (104, "Manu", 20, 100000),
    (105, "Jeena", 27, 300000),
]

f = pd.DataFrame(emp_data, columns=["id", "name", "age", "salary"])
f

    id    name  age  salary
0  101  Deepak   25  250000
1  102   Shyam   22  300000
2  103    Arun   23  150000
3  104    Manu   20  100000
4  105   Jeena   27  300000

In [18]:
f.to_csv("/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/tocsv_amal.csv")

In [19]:
f.to_csv("/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/tocsv_amal.csv", index = False, columns = ["id","name"])
f

    id    name  age  salary
0  101  Deepak   25  250000
1  102   Shyam   22  300000
2  103    Arun   23  150000
3  104    Manu   20  100000
4  105   Jeena   27  300000

In [20]:
f.to_excel("/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/tocsv_amal.xlsx")

In [21]:
df = pd.DataFrame({"value":[10,20,30,40,50]})
df2 = pd.DataFrame({"value":[100,200,300,400,500]})
df

   value
0     10
1     20
2     30
3     40
4     50

In [22]:
with pd.ExcelWriter(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/multi.xlsx") as wr:
    df.to_excel(wr,sheet_name = "SheetA")
    df2.to_excel(wr,sheet_name = "SheetB")

In [23]:
data = pd.read_csv("/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/Churn_Modelling.csv")
data

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,9997,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,9998,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,9999,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,10000,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [24]:
def convert_people(co):
    if co == 20:
        return "Hello"

    else:
        return co

In [25]:
data1 = pd.read_excel(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/multi.xlsx","SheetA",converters={"value":convert_people})
data1

   Unnamed: 0  value
0           0     10
1           1  Hello
2           2     30
3           3     40
4           4     50

In [26]:
std_data = [
    (1, "Deepak", 15, 45,37,24,67),
    (2, "Shyam", 16, 46,42,41,35),
    (3, "Arun", 14, 36,39,45,48),
    (4, "Manu", 15, 24,46,37,42),
    (5, "Jeena", 15, 47,24,45,37),
]

g = pd.DataFrame(std_data, columns=["id", "name", "age", "mark1","mark2","mark3","mark4"])
g.to_excel("/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/toexel_marksheet.xlsx")

In [27]:

def convert_student(co):
    if co == "Manu":
        return "---"

    else:
        return co

In [28]:
data2 = pd.read_excel(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/toexel_marksheet.xlsx",converters={"name":convert_student})
data2

   Unnamed: 0  id    name  age  mark1  mark2  mark3  mark4
0           0   1  Deepak   15     45     37     24     67
1           1   2   Shyam   16     46     42     41     35
2           2   3    Arun   14     36     39     45     48
3           3   4     ---   15     24     46     37     42
4           4   5   Jeena   15     47     24     45     37

In [29]:
data = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv")
data = pd.DataFrame(data)
data

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [30]:
print(data.shape)

(12, 5)

In [31]:
print(data.head())

          day     city  temperature  windspeed  event
0  01-01-2017  newyork           32          6   Rain
1  01-04-2017  newyork           36          7  Sunny
2  01-05-2017  newyork           28         12   Snow
3  01-06-2017  newyork           33          7  Sunny
4  01-07-2017   mumbai           90          5  Sunny

In [32]:
print(data.tail(3))

           day   city  temperature  windspeed   event
9   01-12-2017  paris           50         13  Cloudy
10  01-13-2017  paris           54          8  Cloudy
11  01-14-2017  paris           42         10  Cloudy

In [33]:
print(data.columns)

Index(['day', 'city', 'temperature', 'windspeed', 'event'], dtype='object')

In [34]:
a = data.city
a

0     newyork
1     newyork
2     newyork
3     newyork
4      mumbai
5      mumbai
6      mumbai
7      mumbai
8       paris
9       paris
10      paris
11      paris
Name: city, dtype: object

In [35]:
print(data[["day","city","event"]])

           day     city   event
0   01-01-2017  newyork    Rain
1   01-04-2017  newyork   Sunny
2   01-05-2017  newyork    Snow
3   01-06-2017  newyork   Sunny
4   01-07-2017   mumbai   Sunny
5   01-08-2017   mumbai     Fog
6   01-09-2017   mumbai     Fog
7   01-10-2017   mumbai    Rain
8   01-11-2017    paris   Sunny
9   01-12-2017    paris  Cloudy
10  01-13-2017    paris  Cloudy
11  01-14-2017    paris  Cloudy

In [36]:
print(data.index)

RangeIndex(start=0, stop=12, step=1)

In [37]:
print(data.set_index("event"))

               day     city  temperature  windspeed
event
Rain    01-01-2017  newyork           32          6
Sunny   01-04-2017  newyork           36          7
Snow    01-05-2017  newyork           28         12
Sunny   01-06-2017  newyork           33          7
Sunny   01-07-2017   mumbai           90          5
Fog     01-08-2017   mumbai           85         12
Fog     01-09-2017   mumbai           87         15
Rain    01-10-2017   mumbai           92          5
Sunny   01-11-2017    paris           45         20
Cloudy  01-12-2017    paris           50         13
Cloudy  01-13-2017    paris           54          8
Cloudy  01-14-2017    paris           42         10

In [38]:
data.reset_index()

    index         day     city  temperature  windspeed   event
0       0  01-01-2017  newyork           32          6    Rain
1       1  01-04-2017  newyork           36          7   Sunny
2       2  01-05-2017  newyork           28         12    Snow
3       3  01-06-2017  newyork           33          7   Sunny
4       4  01-07-2017   mumbai           90          5   Sunny
5       5  01-08-2017   mumbai           85         12     Fog
6       6  01-09-2017   mumbai           87         15     Fog
7       7  01-10-2017   mumbai           92          5    Rain
8       8  01-11-2017    paris           45         20   Sunny
9       9  01-12-2017    paris           50         13  Cloudy
10     10  01-13-2017    paris           54          8  Cloudy
11     11  01-14-2017    paris           42         10  Cloudy

In [39]:
data["new_column"]= data["city"]
data

           day     city  temperature  windspeed   event new_column
0   01-01-2017  newyork           32          6    Rain    newyork
1   01-04-2017  newyork           36          7   Sunny    newyork
2   01-05-2017  newyork           28         12    Snow    newyork
3   01-06-2017  newyork           33          7   Sunny    newyork
4   01-07-2017   mumbai           90          5   Sunny     mumbai
5   01-08-2017   mumbai           85         12     Fog     mumbai
6   01-09-2017   mumbai           87         15     Fog     mumbai
7   01-10-2017   mumbai           92          5    Rain     mumbai
8   01-11-2017    paris           45         20   Sunny      paris
9   01-12-2017    paris           50         13  Cloudy      paris
10  01-13-2017    paris           54          8  Cloudy      paris
11  01-14-2017    paris           42         10  Cloudy      paris

In [40]:
data.drop(["new_column"],axis = 1)
data

           day     city  temperature  windspeed   event new_column
0   01-01-2017  newyork           32          6    Rain    newyork
1   01-04-2017  newyork           36          7   Sunny    newyork
2   01-05-2017  newyork           28         12    Snow    newyork
3   01-06-2017  newyork           33          7   Sunny    newyork
4   01-07-2017   mumbai           90          5   Sunny     mumbai
5   01-08-2017   mumbai           85         12     Fog     mumbai
6   01-09-2017   mumbai           87         15     Fog     mumbai
7   01-10-2017   mumbai           92          5    Rain     mumbai
8   01-11-2017    paris           45         20   Sunny      paris
9   01-12-2017    paris           50         13  Cloudy      paris
10  01-13-2017    paris           54          8  Cloudy      paris
11  01-14-2017    paris           42         10  Cloudy      paris

In [41]:
data.drop(["new_column"],axis = 1,inplace =True)
data

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [42]:
data.sort_values(["temperature"],ascending = True)
data

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [43]:
data.loc[4]

day            01-07-2017
city               mumbai
temperature            90
windspeed               5
event               Sunny
Name: 4, dtype: object

In [44]:
print(data.loc[data.city == "newyork"])

          day     city  temperature  windspeed  event
0  01-01-2017  newyork           32          6   Rain
1  01-04-2017  newyork           36          7  Sunny
2  01-05-2017  newyork           28         12   Snow
3  01-06-2017  newyork           33          7  Sunny

In [45]:
emp_data_list = [
    {"id": 101, "name": "Deepak", "age": 25, "salary": 250000},
    {"id": 102, "name": "Shyam", "age": 22, "salary": 300000},
    {"id": 103, "name": "Arun", "age": 23, "salary": 150000},
    {"id": 104, "name": "Manu", "age": 20, "salary": 100000},
    {"id": 105, "name": "Jeena", "age": 27, "salary": 300000},
]

df = pd.DataFrame(emp_data_list)
df

    id    name  age  salary
0  101  Deepak   25  250000
1  102   Shyam   22  300000
2  103    Arun   23  150000
3  104    Manu   20  100000
4  105   Jeena   27  300000

In [46]:
dat = df.set_index("name")
dat.loc[["Arun","Manu"]]

       id  age  salary
name
Arun  103   23  150000
Manu  104   20  100000

In [47]:
df.iloc[2]

id           103
name        Arun
age           23
salary    150000
Name: 2, dtype: object

In [48]:
df.iloc[[0,2,4]]

    id    name  age  salary
0  101  Deepak   25  250000
2  103    Arun   23  150000
4  105   Jeena   27  300000

In [49]:
df.iloc[1:2]

    id   name  age  salary
1  102  Shyam   22  300000

In [50]:
df.iloc[1:5]

    id   name  age  salary
1  102  Shyam   22  300000
2  103   Arun   23  150000
3  104   Manu   20  100000
4  105  Jeena   27  300000

In [51]:
df.dtypes

id         int64
name      object
age        int64
salary     int64
dtype: object

In [52]:
w = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv")
w

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [53]:
for i in w:
    print(i)

day
city
temperature
windspeed
event

In [54]:
w[1:6]

          day     city  temperature  windspeed  event
1  01-04-2017  newyork           36          7  Sunny
2  01-05-2017  newyork           28         12   Snow
3  01-06-2017  newyork           33          7  Sunny
4  01-07-2017   mumbai           90          5  Sunny
5  01-08-2017   mumbai           85         12    Fog

In [55]:
w[:]

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [56]:
w[["city","event","temperature"]][1:4]

      city  event  temperature
1  newyork  Sunny           36
2  newyork   Snow           28
3  newyork  Sunny           33

In [57]:
data

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [58]:
data["temperature"].max()

np.int64(92)

In [59]:
data.temperature.max()

np.int64(92)

In [60]:
data["temperature"].min()

np.int64(28)

In [61]:
data["temperature"].std()

np.float64(25.04480832912131)

In [62]:
data["temperature"].var()

np.float64(627.2424242424241)

In [63]:
data["city"][data.temperature==data.temperature.max()]

7    mumbai
Name: city, dtype: object

In [64]:
type(data["day"][0])

str

In [65]:
data1 = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv", parse_dates = ["day"])
data1

          day     city  temperature  windspeed   event
0  2017-01-01  newyork           32          6    Rain
1  2017-01-04  newyork           36          7   Sunny
2  2017-01-05  newyork           28         12    Snow
3  2017-01-06  newyork           33          7   Sunny
4  2017-01-07   mumbai           90          5   Sunny
5  2017-01-08   mumbai           85         12     Fog
6  2017-01-09   mumbai           87         15     Fog
7  2017-01-10   mumbai           92          5    Rain
8  2017-01-11    paris           45         20   Sunny
9  2017-01-12    paris           50         13  Cloudy
10 2017-01-13    paris           54          8  Cloudy
11 2017-01-14    paris           42         10  Cloudy

In [66]:
type(data["day"][10])

str

In [67]:
data1.set_index("day")

               city  temperature  windspeed   event
day
2017-01-01  newyork           32          6    Rain
2017-01-04  newyork           36          7   Sunny
2017-01-05  newyork           28         12    Snow
2017-01-06  newyork           33          7   Sunny
2017-01-07   mumbai           90          5   Sunny
2017-01-08   mumbai           85         12     Fog
2017-01-09   mumbai           87         15     Fog
2017-01-10   mumbai           92          5    Rain
2017-01-11    paris           45         20   Sunny
2017-01-12    paris           50         13  Cloudy
2017-01-13    paris           54          8  Cloudy
2017-01-14    paris           42         10  Cloudy

In [68]:
data = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv",parse_dates = ["day"], index_col = 'day')
data

               city  temperature  windspeed   event
day
2017-01-01  newyork           32          6    Rain
2017-01-04  newyork           36          7   Sunny
2017-01-05  newyork           28         12    Snow
2017-01-06  newyork           33          7   Sunny
2017-01-07   mumbai           90          5   Sunny
2017-01-08   mumbai           85         12     Fog
2017-01-09   mumbai           87         15     Fog
2017-01-10   mumbai           92          5    Rain
2017-01-11    paris           45         20   Sunny
2017-01-12    paris           50         13  Cloudy
2017-01-13    paris           54          8  Cloudy
2017-01-14    paris           42         10  Cloudy

In [69]:
dt = pd.date_range(start="2017-01-01",end="2017-07-03", freq = "d")
dt

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10',
               ...
               '2017-06-24', '2017-06-25', '2017-06-26', '2017-06-27',
               '2017-06-28', '2017-06-29', '2017-06-30', '2017-07-01',
               '2017-07-02', '2017-07-03'],
              dtype='datetime64[ns]', length=184, freq='D')

In [70]:
dt = pd.date_range(start="2017-01-01",end="2017-07-03", freq = "ME")
dt

DatetimeIndex(['2017-01-31', '2017-02-28', '2017-03-31', '2017-04-30',
               '2017-05-31', '2017-06-30'],
              dtype='datetime64[ns]', freq='ME')

In [71]:

dt = pd.date_range(start="2017-01-01",end="2017-07-03", freq = "YE")
dt

DatetimeIndex([], dtype='datetime64[ns]', freq='YE-DEC')

In [72]:
pd.to_datetime("19/5/15",yearfirst = True)

Timestamp('2019-05-15 00:00:00')

In [73]:
pd.to_datetime("19/5/15",dayfirst = True)

Timestamp('2015-05-19 00:00:00')

In [74]:
data = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/titanic.csv", delimiter = "\t")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [75]:
data.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
151,False,False,False,False,False,False,False,False,False,False,False,False
152,False,False,False,False,False,False,False,False,False,False,True,False
153,False,False,False,False,False,False,False,False,False,False,True,False
154,False,False,False,False,False,True,False,False,False,False,True,False
155,False,False,False,False,False,False,False,False,False,False,True,False

In [76]:
data.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [77]:

data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             30
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          125
Embarked         1
dtype: int64

In [78]:

data.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
151,False,False,False,False,False,False,False,False,False,False,False,False
152,False,False,False,False,False,False,False,False,False,False,True,False
153,False,False,False,False,False,False,False,False,False,False,True,False
154,False,False,False,False,False,True,False,False,False,False,True,False
155,False,False,False,False,False,False,False,False,False,False,True,False

In [79]:

data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             30
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          125
Embarked         1
dtype: int64

In [80]:

data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [81]:
print(data.isnull().any().any())

True

In [82]:
new_data = data.fillna(0)
new_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,0,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,0,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,0.0,0,0,Fa 265302,7.3125,0,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,0,C

In [83]:

new_data.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

In [84]:
new_data1 = data.fillna({"Cabin":0,"Age":"Unknown"})
new_data1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,0,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,0,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,Unknown,0,0,Fa 265302,7.3125,0,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,0,C

In [85]:
sample = pd.DataFrame({"Name":["Anu","Amal",np.nan,"Charlie","Vicky"],"Age":[np.nan,34,np.nan,28,19],"Mark":[123,np.nan,115,28,np.nan]})
sample

      Name   Age   Mark
0      Anu   NaN  123.0
1     Amal  34.0    NaN
2      NaN   NaN  115.0
3  Charlie  28.0   28.0
4    Vicky  19.0    NaN

In [86]:
sample["Mark"].fillna(sample["Mark"].mean(),inplace=True)
sample

/tmp/ipykernel_17346/2602090337.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  sample["Mark"].fillna(sample["Mark"].mean(),inplace=True)

      Name   Age        Mark
0      Anu   NaN  123.000000
1     Amal  34.0   88.666667
2      NaN   NaN  115.000000
3  Charlie  28.0   28.000000
4    Vicky  19.0   88.666667

In [87]:
new_data = sample.fillna(method="ffill")
new_data

/tmp/ipykernel_17346/1947750130.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data = sample.fillna(method="ffill")

      Name   Age        Mark
0      Anu   NaN  123.000000
1     Amal  34.0   88.666667
2     Amal  34.0  115.000000
3  Charlie  28.0   28.000000
4    Vicky  19.0   88.666667

In [88]:

new_data = sample.fillna(method="bfill")
new_data

/tmp/ipykernel_17346/2866752689.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data = sample.fillna(method="bfill")

      Name   Age        Mark
0      Anu  34.0  123.000000
1     Amal  34.0   88.666667
2  Charlie  28.0  115.000000
3  Charlie  28.0   28.000000
4    Vicky  19.0   88.666667

In [89]:
s = pd.Series([np.nan,"single_one",np.nan,"fill_two_more",np.nan,np.nan,np.nan,3.71,np.nan])
s

0              NaN
1       single_one
2              NaN
3    fill_two_more
4              NaN
5              NaN
6              NaN
7             3.71
8              NaN
dtype: object

In [90]:
s.interpolate(method = "pad",limit = 1)

/tmp/ipykernel_17346/537269135.py:1: FutureWarning: Series.interpolate with method=pad is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.interpolate(method = "pad",limit = 1)

0              NaN
1       single_one
2       single_one
3    fill_two_more
4    fill_two_more
5              NaN
6              NaN
7             3.71
8             3.71
dtype: object

In [91]:

s.interpolate(method = "backfill",limit = 1)

/tmp/ipykernel_17346/1626897218.py:1: FutureWarning: Series.interpolate with method=backfill is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.interpolate(method = "backfill",limit = 1)

0       single_one
1       single_one
2    fill_two_more
3    fill_two_more
4              NaN
5              NaN
6             3.71
7             3.71
8              NaN
dtype: object

In [92]:
sample

      Name   Age        Mark
0      Anu   NaN  123.000000
1     Amal  34.0   88.666667
2      NaN   NaN  115.000000
3  Charlie  28.0   28.000000
4    Vicky  19.0   88.666667

In [93]:
new_dif = sample.dropna()
new_dif

      Name   Age       Mark
1     Amal  34.0  88.666667
3  Charlie  28.0  28.000000
4    Vicky  19.0  88.666667

In [94]:
a = pd.DataFrame(
    {"name":["muhammed","shahil",np.nan,"anjali"],
     "age":[np.nan,24,np.nan,np.nan],
     "mark":[np.nan,24,np.nan,34],
     "mark2":[np.nan,24,np.nan,34]
    }
)
print (a)

       name   age  mark  mark2
0  muhammed   NaN   NaN    NaN
1    shahil  24.0  24.0   24.0
2       NaN   NaN   NaN    NaN
3    anjali   NaN  34.0   34.0

In [95]:
new_a = a.dropna(thresh = 1)
new_a

       name   age  mark  mark2
0  muhammed   NaN   NaN    NaN
1    shahil  24.0  24.0   24.0
3    anjali   NaN  34.0   34.0

In [96]:
data = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv", parse_dates = ["day"])
data

          day     city  temperature  windspeed   event
0  2017-01-01  newyork           32          6    Rain
1  2017-01-04  newyork           36          7   Sunny
2  2017-01-05  newyork           28         12    Snow
3  2017-01-06  newyork           33          7   Sunny
4  2017-01-07   mumbai           90          5   Sunny
5  2017-01-08   mumbai           85         12     Fog
6  2017-01-09   mumbai           87         15     Fog
7  2017-01-10   mumbai           92          5    Rain
8  2017-01-11    paris           45         20   Sunny
9  2017-01-12    paris           50         13  Cloudy
10 2017-01-13    paris           54          8  Cloudy
11 2017-01-14    paris           42         10  Cloudy

In [97]:
a = data.replace(36,np.nan)
a

          day     city  temperature  windspeed   event
0  2017-01-01  newyork         32.0          6    Rain
1  2017-01-04  newyork          NaN          7   Sunny
2  2017-01-05  newyork         28.0         12    Snow
3  2017-01-06  newyork         33.0          7   Sunny
4  2017-01-07   mumbai         90.0          5   Sunny
5  2017-01-08   mumbai         85.0         12     Fog
6  2017-01-09   mumbai         87.0         15     Fog
7  2017-01-10   mumbai         92.0          5    Rain
8  2017-01-11    paris         45.0         20   Sunny
9  2017-01-12    paris         50.0         13  Cloudy
10 2017-01-13    paris         54.0          8  Cloudy
11 2017-01-14    paris         42.0         10  Cloudy

In [98]:
b = data.replace(np.nan, 32)
b

          day     city  temperature  windspeed   event
0  2017-01-01  newyork           32          6    Rain
1  2017-01-04  newyork           36          7   Sunny
2  2017-01-05  newyork           28         12    Snow
3  2017-01-06  newyork           33          7   Sunny
4  2017-01-07   mumbai           90          5   Sunny
5  2017-01-08   mumbai           85         12     Fog
6  2017-01-09   mumbai           87         15     Fog
7  2017-01-10   mumbai           92          5    Rain
8  2017-01-11    paris           45         20   Sunny
9  2017-01-12    paris           50         13  Cloudy
10 2017-01-13    paris           54          8  Cloudy
11 2017-01-14    paris           42         10  Cloudy

In [99]:
data.replace([33,"sunny"],"unknown")

          day     city temperature  windspeed   event
0  2017-01-01  newyork          32          6    Rain
1  2017-01-04  newyork          36          7   Sunny
2  2017-01-05  newyork          28         12    Snow
3  2017-01-06  newyork     unknown          7   Sunny
4  2017-01-07   mumbai          90          5   Sunny
5  2017-01-08   mumbai          85         12     Fog
6  2017-01-09   mumbai          87         15     Fog
7  2017-01-10   mumbai          92          5    Rain
8  2017-01-11    paris          45         20   Sunny
9  2017-01-12    paris          50         13  Cloudy
10 2017-01-13    paris          54          8  Cloudy
11 2017-01-14    paris          42         10  Cloudy

In [100]:
data.replace({"temparate":50,"windspeed":12,"event":"rain"},np.nan)

          day     city  temperature  windspeed   event
0  2017-01-01  newyork           32        6.0    Rain
1  2017-01-04  newyork           36        7.0   Sunny
2  2017-01-05  newyork           28        NaN    Snow
3  2017-01-06  newyork           33        7.0   Sunny
4  2017-01-07   mumbai           90        5.0   Sunny
5  2017-01-08   mumbai           85        NaN     Fog
6  2017-01-09   mumbai           87       15.0     Fog
7  2017-01-10   mumbai           92        5.0    Rain
8  2017-01-11    paris           45       20.0   Sunny
9  2017-01-12    paris           50       13.0  Cloudy
10 2017-01-13    paris           54        8.0  Cloudy
11 2017-01-14    paris           42       10.0  Cloudy

In [101]:

data.replace({"temparate":[92,42],"windspeed":[7,5],"event":"rain"},np.nan)

          day     city  temperature  windspeed   event
0  2017-01-01  newyork           32        6.0    Rain
1  2017-01-04  newyork           36        NaN   Sunny
2  2017-01-05  newyork           28       12.0    Snow
3  2017-01-06  newyork           33        NaN   Sunny
4  2017-01-07   mumbai           90        NaN   Sunny
5  2017-01-08   mumbai           85       12.0     Fog
6  2017-01-09   mumbai           87       15.0     Fog
7  2017-01-10   mumbai           92        NaN    Rain
8  2017-01-11    paris           45       20.0   Sunny
9  2017-01-12    paris           50       13.0  Cloudy
10 2017-01-13    paris           54        8.0  Cloudy
11 2017-01-14    paris           42       10.0  Cloudy

In [102]:
data.replace({"city":"[A-Za-z]","event":"[A-Za-z]"},"",regex = True)

          day city  temperature  windspeed event
0  2017-01-01                32          6
1  2017-01-04                36          7
2  2017-01-05                28         12
3  2017-01-06                33          7
4  2017-01-07                90          5
5  2017-01-08                85         12
6  2017-01-09                87         15
7  2017-01-10                92          5
8  2017-01-11                45         20
9  2017-01-12                50         13
10 2017-01-13                54          8
11 2017-01-14                42         10

In [103]:

data = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv")
data

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [104]:
n = data.groupby("city")
print(n)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f1b494baa50>

In [105]:
n.get_group("mumbai")

          day    city  temperature  windspeed  event
4  01-07-2017  mumbai           90          5  Sunny
5  01-08-2017  mumbai           85         12    Fog
6  01-09-2017  mumbai           87         15    Fog
7  01-10-2017  mumbai           92          5   Rain

In [106]:
for city,city_df in n:
    print(city)
    print(city_df)

mumbai
          day    city  temperature  windspeed  event
4  01-07-2017  mumbai           90          5  Sunny
5  01-08-2017  mumbai           85         12    Fog
6  01-09-2017  mumbai           87         15    Fog
7  01-10-2017  mumbai           92          5   Rain
newyork
          day     city  temperature  windspeed  event
0  01-01-2017  newyork           32          6   Rain
1  01-04-2017  newyork           36          7  Sunny
2  01-05-2017  newyork           28         12   Snow
3  01-06-2017  newyork           33          7  Sunny
paris
           day   city  temperature  windspeed   event
8   01-11-2017  paris           45         20   Sunny
9   01-12-2017  paris           50         13  Cloudy
10  01-13-2017  paris           54          8  Cloudy
11  01-14-2017  paris           42         10  Cloudy

In [107]:
print(n.max())
print(n.min())
print(n.sum())

                day  temperature  windspeed  event
city
mumbai   01-10-2017           92         15  Sunny
newyork  01-06-2017           36         12  Sunny
paris    01-14-2017           54         20  Sunny
                day  temperature  windspeed   event
city
mumbai   01-07-2017           85          5     Fog
newyork  01-01-2017           28          6    Rain
paris    01-11-2017           42          8  Cloudy
                                              day  temperature  windspeed  \
city
mumbai   01-07-201701-08-201701-09-201701-10-2017          354         37
newyork  01-01-201701-04-201701-05-201701-06-2017          129         32
paris    01-11-201701-12-201701-13-201701-14-2017          191         51

                           event
city
mumbai           SunnyFogFogRain
newyork       RainSunnySnowSunny
paris    SunnyCloudyCloudyCloudy

In [108]:
print(n.describe())

        temperature                                                   \
              count   mean       std   min    25%   50%    75%   max
city
mumbai          4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
newyork         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris           4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

        windspeed
            count   mean       std  min   25%   50%    75%   max
city
mumbai        4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
newyork       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris         4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [109]:
print(n.get_group("mumbai").max())

day            01-10-2017
city               mumbai
temperature            92
windspeed              15
event               Sunny
dtype: object

In [110]:
grp = data.groupby(["city","event"])
grp

In [111]:
grp.get_group(("newyork","Rain"))

          day     city  temperature  windspeed event
0  01-01-2017  newyork           32          6  Rain

In [112]:
for city,city_df in grp:
    print (city)
    print (city_df)

('mumbai', 'Fog')
          day    city  temperature  windspeed event
5  01-08-2017  mumbai           85         12   Fog
6  01-09-2017  mumbai           87         15   Fog
('mumbai', 'Rain')
          day    city  temperature  windspeed event
7  01-10-2017  mumbai           92          5  Rain
('mumbai', 'Sunny')
          day    city  temperature  windspeed  event
4  01-07-2017  mumbai           90          5  Sunny
('newyork', 'Rain')
          day     city  temperature  windspeed event
0  01-01-2017  newyork           32          6  Rain
('newyork', 'Snow')
          day     city  temperature  windspeed event
2  01-05-2017  newyork           28         12  Snow
('newyork', 'Sunny')
          day     city  temperature  windspeed  event
1  01-04-2017  newyork           36          7  Sunny
3  01-06-2017  newyork           33          7  Sunny
('paris', 'Cloudy')
           day   city  temperature  windspeed   event
9   01-12-2017  paris           50         13  Cloudy
10  01-13-2017  paris           54          8  Cloudy
11  01-14-2017  paris           42         10  Cloudy
('paris', 'Sunny')
          day   city  temperature  windspeed  event
8  01-11-2017  paris           45         20  Sunny

In [113]:
tcs = {"id": [101,102,103,104],
       "Name": ["Midhun","Dipin","Jose","Rahul"],
       "Age": [25,26,27,29]
      }
wipro = {"id": [101,102,103,104],
       "Name": ["Dev","Sreenadh","Sreerag","Shafeel"],
       "Age": [25,26,27,29]
      }
tcs_emp = pd.DataFrame(tcs)
wipro_emp = pd.DataFrame(wipro)
print(tcs_emp)
print(wipro_emp)

    id    Name  Age
0  101  Midhun   25
1  102   Dipin   26
2  103    Jose   27
3  104   Rahul   29
    id      Name  Age
0  101       Dev   25
1  102  Sreenadh   26
2  103   Sreerag   27
3  104   Shafeel   29

In [114]:
print(pd.concat([tcs_emp,wipro_emp]))

    id      Name  Age
0  101    Midhun   25
1  102     Dipin   26
2  103      Jose   27
3  104     Rahul   29
0  101       Dev   25
1  102  Sreenadh   26
2  103   Sreerag   27
3  104   Shafeel   29

In [115]:
print(pd.concat([tcs_emp,wipro_emp], ignore_index = True))

    id      Name  Age
0  101    Midhun   25
1  102     Dipin   26
2  103      Jose   27
3  104     Rahul   29
4  101       Dev   25
5  102  Sreenadh   26
6  103   Sreerag   27
7  104   Shafeel   29

In [116]:
print(pd.concat([tcs_emp,wipro_emp], keys = ["TCS","WIPRO"]))

          id      Name  Age
TCS   0  101    Midhun   25
      1  102     Dipin   26
      2  103      Jose   27
      3  104     Rahul   29
WIPRO 0  101       Dev   25
      1  102  Sreenadh   26
      2  103   Sreerag   27
      3  104   Shafeel   29

In [117]:
print(pd.concat([tcs_emp,wipro_emp], axis = 1))

    id    Name  Age   id      Name  Age
0  101  Midhun   25  101       Dev   25
1  102   Dipin   26  102  Sreenadh   26
2  103    Jose   27  103   Sreerag   27
3  104   Rahul   29  104   Shafeel   29

In [133]:
tcs = {"id" : [101.102,103,114],
       "name" : ["Mithun","Dipin","Jose","Rahul"],
       "Age" : [25,26,27,29]}
tcs_emp = pd.DataFrame(tcs)
salary = pd.Series([65000,75000,15000,25000],name = "Salary")

pd.concat([tcs_emp,salary])

ValueError: All arrays must be of the same length

In [121]:
pd.merge(tcs_emp,wipro_emp, on = "id", suffixes = ["_left","_right"])

    id Name_left  Age_left Name_right  Age_right
0  101    Midhun        25        Dev         25
1  102     Dipin        26   Sreenadh         26
2  103      Jose        27    Sreerag         27
3  104     Rahul        29    Shafeel         29

In [122]:
print(tcs_emp)
print(wipro_emp)

    id    Name  Age
0  101  Midhun   25
1  102   Dipin   26
2  103    Jose   27
3  104   Rahul   29
    id      Name  Age
0  101       Dev   25
1  102  Sreenadh   26
2  103   Sreerag   27
3  104   Shafeel   29

In [125]:
pd.merge(tcs_emp, wipro_emp,on="id",how= "outer")

    id  Name_x  Age_x    Name_y  Age_y
0  101  Midhun     25       Dev     25
1  102   Dipin     26  Sreenadh     26
2  103    Jose     27   Sreerag     27
3  104   Rahul     29   Shafeel     29

In [127]:
pd.merge(tcs_emp, wipro_emp,on="id",how= "outer", indicator = True)

    id  Name_x  Age_x    Name_y  Age_y _merge
0  101  Midhun     25       Dev     25   both
1  102   Dipin     26  Sreenadh     26   both
2  103    Jose     27   Sreerag     27   both
3  104   Rahul     29   Shafeel     29   both

In [126]:
pd.merge(tcs_emp, wipro_emp,on="id",how= "left")

    id  Name_x  Age_x    Name_y  Age_y
0  101  Midhun     25       Dev     25
1  102   Dipin     26  Sreenadh     26
2  103    Jose     27   Sreerag     27
3  104   Rahul     29   Shafeel     29

In [128]:

pd.merge(tcs_emp, wipro_emp,on="id",how= "right")

    id  Name_x  Age_x    Name_y  Age_y
0  101  Midhun     25       Dev     25
1  102   Dipin     26  Sreenadh     26
2  103    Jose     27   Sreerag     27
3  104   Rahul     29   Shafeel     29

In [132]:
 
data1 = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv", parse_dates = ["day"])
data1

          day     city  temperature  windspeed   event
0  2017-01-01  newyork           32          6    Rain
1  2017-01-04  newyork           36          7   Sunny
2  2017-01-05  newyork           28         12    Snow
3  2017-01-06  newyork           33          7   Sunny
4  2017-01-07   mumbai           90          5   Sunny
5  2017-01-08   mumbai           85         12     Fog
6  2017-01-09   mumbai           87         15     Fog
7  2017-01-10   mumbai           92          5    Rain
8  2017-01-11    paris           45         20   Sunny
9  2017-01-12    paris           50         13  Cloudy
10 2017-01-13    paris           54          8  Cloudy
11 2017-01-14    paris           42         10  Cloudy

In [136]:
data1.pivot(columns = "city", index = "day")

           temperature               windspeed                event          \
city            mumbai newyork paris    mumbai newyork paris mumbai newyork
day
2017-01-01         NaN    32.0   NaN       NaN     6.0   NaN    NaN    Rain
2017-01-04         NaN    36.0   NaN       NaN     7.0   NaN    NaN   Sunny
2017-01-05         NaN    28.0   NaN       NaN    12.0   NaN    NaN    Snow
2017-01-06         NaN    33.0   NaN       NaN     7.0   NaN    NaN   Sunny
2017-01-07        90.0     NaN   NaN       5.0     NaN   NaN  Sunny     NaN
2017-01-08        85.0     NaN   NaN      12.0     NaN   NaN    Fog     NaN
2017-01-09        87.0     NaN   NaN      15.0     NaN   NaN    Fog     NaN
2017-01-10        92.0     NaN   NaN       5.0     NaN   NaN   Rain     NaN
2017-01-11         NaN     NaN  45.0       NaN     NaN  20.0    NaN     NaN
2017-01-12         NaN     NaN  50.0       NaN     NaN  13.0    NaN     NaN
2017-01-13         NaN     NaN  54.0       NaN     NaN   8.0    NaN     NaN
2017-01-14         NaN     NaN  42.0       NaN     NaN  10.0    NaN     NaN


city         paris
day
2017-01-01     NaN
2017-01-04     NaN
2017-01-05     NaN
2017-01-06     NaN
2017-01-07     NaN
2017-01-08     NaN
2017-01-09     NaN
2017-01-10     NaN
2017-01-11   Sunny
2017-01-12  Cloudy
2017-01-13  Cloudy
2017-01-14  Cloudy

In [138]:

data1.pivot(columns = "city", index = "day",values = "temperature")

city        mumbai  newyork  paris
day
2017-01-01     NaN     32.0    NaN
2017-01-04     NaN     36.0    NaN
2017-01-05     NaN     28.0    NaN
2017-01-06     NaN     33.0    NaN
2017-01-07    90.0      NaN    NaN
2017-01-08    85.0      NaN    NaN
2017-01-09    87.0      NaN    NaN
2017-01-10    92.0      NaN    NaN
2017-01-11     NaN      NaN   45.0
2017-01-12     NaN      NaN   50.0
2017-01-13     NaN      NaN   54.0
2017-01-14     NaN      NaN   42.0

In [139]:

data1.pivot(columns = "day", index = "city")

        temperature                                                         \
day      2017-01-01 2017-01-04 2017-01-05 2017-01-06 2017-01-07 2017-01-08
city
mumbai          NaN        NaN        NaN        NaN       90.0       85.0
newyork        32.0       36.0       28.0       33.0        NaN        NaN
paris           NaN        NaN        NaN        NaN        NaN        NaN

                                                     ...      event  \
day     2017-01-09 2017-01-10 2017-01-11 2017-01-12  ... 2017-01-05
city                                                 ...
mumbai        87.0       92.0        NaN        NaN  ...        NaN
newyork        NaN        NaN        NaN        NaN  ...       Snow
paris          NaN        NaN       45.0       50.0  ...        NaN

                                                                           \
day     2017-01-06 2017-01-07 2017-01-08 2017-01-09 2017-01-10 2017-01-11
city
mumbai         NaN      Sunny        Fog        Fog       Rain        NaN
newyork      Sunny        NaN        NaN        NaN        NaN        NaN
paris          NaN        NaN        NaN        NaN        NaN      Sunny


day     2017-01-12 2017-01-13 2017-01-14
city
mumbai         NaN        NaN        NaN
newyork        NaN        NaN        NaN
paris       Cloudy     Cloudy     Cloudy

[3 rows x 36 columns]

In [143]:

data1.pivot_table(columns = "day", index = "city",aggfunc = "sum", margins =True)

             event                                                         \
day     01-01-2017 01-04-2017 01-05-2017 01-06-2017 01-07-2017 01-08-2017
city
mumbai         NaN        NaN        NaN        NaN      Sunny        Fog
newyork       Rain      Sunny       Snow      Sunny        NaN        NaN
paris          NaN        NaN        NaN        NaN        NaN        NaN
All           Rain      Sunny       Snow      Sunny      Sunny        Fog

                                                     ...  windspeed  \
day     01-09-2017 01-10-2017 01-11-2017 01-12-2017  ... 01-06-2017
city                                                 ...
mumbai         Fog       Rain        NaN        NaN  ...        NaN
newyork        NaN        NaN        NaN        NaN  ...        7.0
paris          NaN        NaN      Sunny     Cloudy  ...        NaN
All            Fog       Rain      Sunny     Cloudy  ...          7

                                                                           \
day     01-07-2017 01-08-2017 01-09-2017 01-10-2017 01-11-2017 01-12-2017
city
mumbai         5.0       12.0       15.0        5.0        NaN        NaN
newyork        NaN        NaN        NaN        NaN        NaN        NaN
paris          NaN        NaN        NaN        NaN       20.0       13.0
All              5         12         15          5         20         13


day     01-13-2017 01-14-2017  All
city
mumbai         NaN        NaN   37
newyork        NaN        NaN   32
paris          8.0       10.0   51
All              8         10  120

[4 rows x 39 columns]

In [144]:

data1 = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv")
data1

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [145]:
print(pd.melt(data1,id_vars = ["city"]))

       city     variable       value
0   newyork          day  01-01-2017
1   newyork          day  01-04-2017
2   newyork          day  01-05-2017
3   newyork          day  01-06-2017
4    mumbai          day  01-07-2017
5    mumbai          day  01-08-2017
6    mumbai          day  01-09-2017
7    mumbai          day  01-10-2017
8     paris          day  01-11-2017
9     paris          day  01-12-2017
10    paris          day  01-13-2017
11    paris          day  01-14-2017
12  newyork  temperature          32
13  newyork  temperature          36
14  newyork  temperature          28
15  newyork  temperature          33
16   mumbai  temperature          90
17   mumbai  temperature          85
18   mumbai  temperature          87
19   mumbai  temperature          92
20    paris  temperature          45
21    paris  temperature          50
22    paris  temperature          54
23    paris  temperature          42
24  newyork    windspeed           6
25  newyork    windspeed           7
26  newyork    windspeed          12
27  newyork    windspeed           7
28   mumbai    windspeed           5
29   mumbai    windspeed          12
30   mumbai    windspeed          15
31   mumbai    windspeed           5
32    paris    windspeed          20
33    paris    windspeed          13
34    paris    windspeed           8
35    paris    windspeed          10
36  newyork        event        Rain
37  newyork        event       Sunny
38  newyork        event        Snow
39  newyork        event       Sunny
40   mumbai        event       Sunny
41   mumbai        event         Fog
42   mumbai        event         Fog
43   mumbai        event        Rain
44    paris        event       Sunny
45    paris        event      Cloudy
46    paris        event      Cloudy
47    paris        event      Cloudy

In [146]:
pd.melt(data1,id_vars = ["day"],value_name = "value_1",var_name = "col_name")

           day     col_name  value_1
0   01-01-2017         city  newyork
1   01-04-2017         city  newyork
2   01-05-2017         city  newyork
3   01-06-2017         city  newyork
4   01-07-2017         city   mumbai
5   01-08-2017         city   mumbai
6   01-09-2017         city   mumbai
7   01-10-2017         city   mumbai
8   01-11-2017         city    paris
9   01-12-2017         city    paris
10  01-13-2017         city    paris
11  01-14-2017         city    paris
12  01-01-2017  temperature       32
13  01-04-2017  temperature       36
14  01-05-2017  temperature       28
15  01-06-2017  temperature       33
16  01-07-2017  temperature       90
17  01-08-2017  temperature       85
18  01-09-2017  temperature       87
19  01-10-2017  temperature       92
20  01-11-2017  temperature       45
21  01-12-2017  temperature       50
22  01-13-2017  temperature       54
23  01-14-2017  temperature       42
24  01-01-2017    windspeed        6
25  01-04-2017    windspeed        7
26  01-05-2017    windspeed       12
27  01-06-2017    windspeed        7
28  01-07-2017    windspeed        5
29  01-08-2017    windspeed       12
30  01-09-2017    windspeed       15
31  01-10-2017    windspeed        5
32  01-11-2017    windspeed       20
33  01-12-2017    windspeed       13
34  01-13-2017    windspeed        8
35  01-14-2017    windspeed       10
36  01-01-2017        event     Rain
37  01-04-2017        event    Sunny
38  01-05-2017        event     Snow
39  01-06-2017        event    Sunny
40  01-07-2017        event    Sunny
41  01-08-2017        event      Fog
42  01-09-2017        event      Fog
43  01-10-2017        event     Rain
44  01-11-2017        event    Sunny
45  01-12-2017        event   Cloudy
46  01-13-2017        event   Cloudy
47  01-14-2017        event   Cloudy

In [147]:

loan_data = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/loan_status.csv")
loan_data

   grade sub_grade  loan_status             purpose
0      B        B2   Fully Paid         credit_card
1      C        C4  Charged Off                 car
2      C        C5   Fully Paid      small_business
3      C        C1   Fully Paid               other
4      B        B5   Fully Paid               other
5      A        A4   Fully Paid             wedding
6      C        C5   Fully Paid  debt_consolidation
7      E        E1   Fully Paid                 car
8      F        F2  Charged Off      small_business
9      B        B5  Charged Off               other
10     C        C3   Fully Paid  debt_consolidation
11     B        B5   Fully Paid  debt_consolidation
12     C        C1  Charged Off  debt_consolidation
13     B        B1   Fully Paid         credit_card
14     B        B2  Charged Off               other
15     D        D1   Fully Paid  debt_consolidation
16     C        C4   Fully Paid    home_improvement
17     A        A1   Fully Paid      major_purchase
18     B        B3   Fully Paid             medical
19     A        A1   Fully Paid  debt_consolidation
20     C        C4   Fully Paid  debt_consolidation
21     B        B4  Charged Off  debt_consolidation
22     B        B3   Fully Paid         credit_card
23     B        B3   Fully Paid  debt_consolidation
24     B        B3  Charged Off      major_purchase
25     B        B1   Fully Paid         credit_card
26     C        C2  Charged Off  debt_consolidation
27     D        D2  Charged Off               other
28     B        B3   Fully Paid  debt_consolidation
29     B        B3   Fully Paid         credit_card
30     A        A3   Fully Paid  debt_consolidation
31     A        A4   Fully Paid  debt_consolidation
32     C        C5   Fully Paid  debt_consolidation
33     A        A5   Fully Paid  debt_consolidation
34     C        C5   Fully Paid         credit_card
35     B        B2   Fully Paid         credit_card
36     B        B1   Fully Paid              moving
37     A        A4   Fully Paid  debt_consolidation
38     B        B4   Fully Paid  debt_consolidation
39     B        B5   Fully Paid  debt_consolidation
40     A        A3   Fully Paid               other
41     A        A4   Fully Paid  debt_consolidation
42     D        D5   Fully Paid               other
43     D        D2   Fully Paid  debt_consolidation
44     A        A1   Fully Paid  debt_consolidation
45     B        B1   Fully Paid      small_business
46     A        A5  Charged Off  debt_consolidation
47     B        B2   Fully Paid               other
48     A        A1   Fully Paid         credit_card
49     B        B1  Charged Off               other

In [148]:
pd.crosstab(loan_data.grade,loan_data.loan_status,margins = True)

loan_status  Charged Off  Fully Paid  All
grade
A                      1          11   12
B                      5          16   21
C                      3           8   11
D                      1           3    4
E                      0           1    1
F                      1           0    1
All                   11          39   50

In [150]:

pd.crosstab(loan_data.grade,[loan_data.loan_status,loan_data.sub_grade],margins = True)

loan_status Charged Off                             ... Fully Paid           \
sub_grade            A5 B1 B2 B3 B4 B5 C1 C2 C4 D2  ...         B5 C1 C3 C4
grade                                               ...
A                     1  0  0  0  0  0  0  0  0  0  ...          0  0  0  0
B                     0  1  1  1  1  1  0  0  0  0  ...          3  0  0  0
C                     0  0  0  0  0  0  1  1  1  0  ...          0  1  1  2
D                     0  0  0  0  0  0  0  0  0  1  ...          0  0  0  0
E                     0  0  0  0  0  0  0  0  0  0  ...          0  0  0  0
F                     0  0  0  0  0  0  0  0  0  0  ...          0  0  0  0
All                   1  1  1  1  1  1  1  1  1  1  ...          3  1  1  2

loan_status                All
sub_grade   C5 D1 D2 D5 E1
grade
A            0  0  0  0  0  12
B            0  0  0  0  0  21
C            4  0  0  0  0  11
D            0  1  1  1  0   4
E            0  0  0  0  1   1
F            0  0  0  0  0   1
All          4  1  1  1  1  50

[7 rows x 29 columns]

In [152]:
def square(x):
    return x*2

abc = [1,2,3,4,5]
out = list(map(square,abc))
out

[2, 4, 6, 8, 10]

In [153]:

data = pd.read_csv(r"/data/Coding_Shennanigans/TechMindz/TM_AI/uv_env/TM_AI_Env/Test_CSV/weather_data.csv")
data

           day     city  temperature  windspeed   event
0   01-01-2017  newyork           32          6    Rain
1   01-04-2017  newyork           36          7   Sunny
2   01-05-2017  newyork           28         12    Snow
3   01-06-2017  newyork           33          7   Sunny
4   01-07-2017   mumbai           90          5   Sunny
5   01-08-2017   mumbai           85         12     Fog
6   01-09-2017   mumbai           87         15     Fog
7   01-10-2017   mumbai           92          5    Rain
8   01-11-2017    paris           45         20   Sunny
9   01-12-2017    paris           50         13  Cloudy
10  01-13-2017    paris           54          8  Cloudy
11  01-14-2017    paris           42         10  Cloudy

In [155]:
data[["windspeed","temperature"]].map(square)

    windspeed  temperature
0          12           64
1          14           72
2          24           56
3          14           66
4          10          180
5          24          170
6          30          174
7          10          184
8          40           90
9          26          100
10         16          108
11         20           84

In [158]:

data[["windspeed","temperature"]].map(lambda y:y*y)

    windspeed  temperature
0          36         1024
1          49         1296
2         144          784
3          49         1089
4          25         8100
5         144         7225
6         225         7569
7          25         8464
8         400         2025
9         169         2500
10         64         2916
11        100         1764

In [160]:

data["windspeed"].map(lambda x:x*x)

0      36
1      49
2     144
3      49
4      25
5     144
6     225
7      25
8     400
9     169
10     64
11    100
Name: windspeed, dtype: int64